tangyangguang/Esp32Base/src/web/internal/WebFs.cpp
#include "../../Esp32BaseProfile.h"

#if ESP32BASE_ENABLE_WEB && ESP32BASE_ENABLE_FS

#include "WebInternal.h"

namespace esp32base_web {

#if ESP32BASE_ENABLE_FS
static const uint8_t FS_TOP_MAX = 10;
static const uint16_t FS_TREE_LIST_LIMIT = 128;
static const uint16_t FS_UPLOAD_DIR_LIMIT = 64;
static const uint8_t FS_SCAN_MAX_DEPTH = 8;

void fsScanYield() {
#if ESP32BASE_ENABLE_WATCHDOG
    Esp32BaseWatchdog::feed();
#endif
    yield();
}

void fsFormatCount(uint32_t count, char* out, size_t len) {
    snprintf(out, len, "%lu", static_cast<unsigned long>(count));
}

void fsJoinPath(const char* dir, const char* name, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (!name || !name[0]) {
        strlcpy(out, dir && dir[0] ? dir : "/", len);
        return;
    }
    if (name[0] == '/') {
        strlcpy(out, name, len);
        return;
    }
    if (!dir || !dir[0] || strcmp(dir, "/") == 0) {
        snprintf(out, len, "/%s", name);
        return;
    }
    snprintf(out, len, "%s/%s", dir, name);
}

void fsAddTopFile(FsScan& scan, const char* path, uint64_t size) {
    uint8_t pos = scan.topCount;
    while (pos > 0 && size > scan.top[pos - 1].size) {
        --pos;
    }
    if (pos >= FS_TOP_MAX) {
        return;
    }
    const uint8_t limit = scan.topCount < FS_TOP_MAX ? scan.topCount : static_cast<uint8_t>(FS_TOP_MAX - 1);
    for (int8_t i = static_cast<int8_t>(limit); i > static_cast<int8_t>(pos); --i) {
        scan.top[i] = scan.top[i - 1];
    }
    if (scan.topCount < FS_TOP_MAX) {
        ++scan.topCount;
    }
    scan.top[pos].size = size;
    strlcpy(scan.top[pos].path, path && path[0] ? path : "-", sizeof(scan.top[pos].path));
}

void sendFsDeleteForm(const char* path) {
    sendChunk("<form method='post' action='/esp32base/fs/delete' onsubmit=\"return confirm('Delete this file? This cannot be undone.')&&once(this)\">");
    sendHiddenInput("path", path && path[0] ? path : "");
    sendChunk("<input class='danger fsdelete' type='submit' value='Delete'></form>");
}

void sendFsDownloadForm(const char* path) {
    sendChunk("<form method='get' action='/esp32base/fs/download'>");
    sendHiddenInput("path", path && path[0] ? path : "");
    sendChunk("<input class='secondary fsaction' type='submit' value='Download'></form>");
}

#if ESP32BASE_ENABLE_APP_EVENTS
bool appEventsOwnsPath(const char* path) {
    return path && strcmp(path, Esp32BaseAppEventLog::path()) == 0;
}

void sendFsReservedAppEventsAction() {
    sendChunk("<div class='fsactions'>");
    sendStatusTag(Esp32BaseWeb::UI_INFO, "app events store");
    sendChunk("</div>");
}
#endif

void sendFsFileActions(const char* path, bool manage) {
#if ESP32BASE_ENABLE_APP_EVENTS
    if (appEventsOwnsPath(path)) {
        sendFsReservedAppEventsAction();
        return;
    }
#endif
    sendChunk("<div class='fsactions'>");
    sendFsDownloadForm(path);
    if (manage) {
        sendFsDeleteForm(path);
    }
    sendChunk("</div>");
}

void sendFsUnreadableActions(const char* path, bool manage) {
#if ESP32BASE_ENABLE_APP_EVENTS
    if (appEventsOwnsPath(path)) {
        sendFsReservedAppEventsAction();
        return;
    }
#endif
    sendChunk("<div class='fsactions'>");
    sendStatusTag(Esp32BaseWeb::UI_WARN, "unreadable");
    if (manage) {
        sendFsDeleteForm(path);
    }
    sendChunk("</div>");
}

bool fsFileReadableStart(const char* path, size_t size) {
    if (size == 0) {
        return true;
    }
    uint8_t value = 0;
    size_t readLen = 0;
    return Esp32BaseFs::readBytesAt(path, 0, &value, 1, &readLen) && readLen == 1;
}

void sendFsTreeRow(const char* path, size_t size, bool isDir, bool manage) {
    char sizeBuf[48];
    sendChunk("<tr><td>");
    sendEscapedHtmlChunk(path && path[0] ? path : "-");
    sendChunk("</td><td>");
    sendEscapedHtmlChunk(isDir ? "dir" : "file");
    sendChunk("</td><td>");
    if (isDir) {
        sendChunk("-");
    } else {
        formatReadableBytes(size, sizeBuf, sizeof(sizeBuf));
        sendEscapedHtmlChunk(sizeBuf);
    }
    sendChunk("</td><td>");
    if (isDir) {
        sendChunk("-");
    } else if (!fsFileReadableStart(path, size)) {
        sendFsUnreadableActions(path, manage);
    } else {
        sendFsFileActions(path, manage);
    }
    sendChunk("</td></tr>");
}

void fsWalkCallback(const char* name, size_t size, bool isDir, void* user);
void fsNoopListCallback(const char*, size_t, bool, void*);

bool fsWalkDir(FsScan& scan, const char* dir, uint8_t depth, bool emitRows, bool manage, uint16_t emitLimit, uint16_t* emittedRows) {
    FsWalkFrame frame = {&scan, dir, depth, emitRows, manage, emitLimit, emittedRows};
    return Esp32BaseFs::listDir(dir, fsWalkCallback, &frame);
}

void fsWalkCallback(const char* name, size_t size, bool isDir, void* user) {
    FsWalkFrame* frame = static_cast<FsWalkFrame*>(user);
    if (!frame || !frame->scan) {
        return;
    }
    char path[96];
    fsJoinPath(frame->dir, name, path, sizeof(path));
    frame->scan->entries++;
    if (isDir) {
        frame->scan->dirs++;
    } else {
        frame->scan->files++;
        frame->scan->listedSize += size;
        fsAddTopFile(*frame->scan, path, size);
    }
    if (frame->emitRows && frame->emittedRows && *frame->emittedRows < frame->emitLimit) {
        sendFsTreeRow(path, size, isDir, frame->manage);
        (*frame->emittedRows)++;
    }
    fsScanYield();
    if (isDir && frame->depth + 1 < FS_SCAN_MAX_DEPTH && (!frame->emitRows || !frame->emittedRows || *frame->emittedRows < frame->emitLimit)) {
        fsWalkDir(*frame->scan, path, static_cast<uint8_t>(frame->depth + 1), frame->emitRows, frame->manage, frame->emitLimit, frame->emittedRows);
    }
}

bool scanFs(FsScan& scan) {
    memset(&scan, 0, sizeof(scan));
    return Esp32BaseFs::isReady() && fsWalkDir(scan, "/", 0, false, false, 0, nullptr);
}

bool fsManageMode() {
    return g_server.hasArg("manage") && g_server.arg("manage") != "0";
}

bool fsInternalUsageHigh(const FsScan& scan) {
    const uint64_t used = Esp32BaseFs::usedBytes();
    if (used <= scan.listedSize) {
        return false;
    }
    const uint64_t gap = used - scan.listedSize;
    return gap > 131072ULL && gap > scan.listedSize;
}

bool validFsFilePath(const char* path) {
    return path && path[0] == '/' && path[1] != '\0' && strlen(path) < 96 &&
           !strstr(path, "..") && !strstr(path, "//");
}

bool validFsDeletePath(const char* path) {
    return validFsFilePath(path);
}

bool validFsDirectoryPath(const char* path) {
    return path && ((strcmp(path, "/") == 0) || validFsFilePath(path));
}

bool fsUploadFilenameValid(const char* name) {
    if (!name || !name[0] || strlen(name) > 63 || strcmp(name, ".") == 0 || strcmp(name, "..") == 0) {
        return false;
    }
    for (const char* p = name; *p; ++p) {
        const unsigned char c = static_cast<unsigned char>(*p);
        if (c < 32 || c == 127 || *p == '/' || *p == '\\' || *p == ':') {
            return false;
        }
    }
    return !strstr(name, "..");
}

bool fsUploadDirectoryExists(const char* dir) {
    if (!validFsDirectoryPath(dir)) {
        return false;
    }
    if (strcmp(dir, "/") == 0) {
        return Esp32BaseFs::isReady();
    }
    return Esp32BaseFs::listDir(dir, fsNoopListCallback, nullptr);
}

bool fsBuildUploadPath(const char* dir, const char* name, char* out, size_t len) {
    if (!out || len == 0 || !validFsDirectoryPath(dir) || !fsUploadFilenameValid(name)) {
        return false;
    }
    int written = 0;
    if (strcmp(dir, "/") == 0) {
        written = snprintf(out, len, "/%s", name);
    } else {
        written = snprintf(out, len, "%s/%s", dir, name);
    }
    if (written <= 0 || static_cast<size_t>(written) >= len) {
        out[0] = '\0';
        return false;
    }
    return validFsFilePath(out);
}

void fsSetUploadError(const char* message) {
    strlcpy(g_fsUploadError, message && message[0] ? message : "upload failed", sizeof(g_fsUploadError));
}

void fsCloseUploadFile() {
    g_fsUploadActive = false;
    fsScanYield();
}

bool fsUploadTargetIsDirectory(const char* path) {
    return validFsFilePath(path) && Esp32BaseFs::listDir(path, fsNoopListCallback, nullptr);
}

bool fsUploadFileReadableEnd(const char* path, uint64_t size) {
    if (size == 0) {
        return true;
    }
    if (size > UINT32_MAX) {
        return false;
    }
    uint8_t value = 0;
    size_t readLen = 0;
    return Esp32BaseFs::readBytesAt(path,
                                    static_cast<uint32_t>(size - 1U),
                                    &value,
                                    1,
                                    &readLen) &&
           readLen == 1;
}

void fsSendJsonBool(const char* name, bool value, bool comma = true) {
    if (comma) {
        sendChunk(",");
    }
    sendChunk("\"");
    sendChunk(name);
    sendChunk("\":");
    sendChunk(value ? "true" : "false");
}

